Pandas data frame object basics

In [2]:
from pandas import Series, DataFrame
import pandas as pd

Simple Examples

In [3]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nervada','Nervada'],
       'year':[2000,2001,2002,2001,2002],
       'pop':[1.5, 1.7, 3.6, 2.4, 2.9]}
frame = DataFrame(data)
frame

   pop    state  year
0  1.5     Ohio  2000
1  1.7     Ohio  2001
2  3.6     Ohio  2002
3  2.4  Nervada  2001
4  2.9  Nervada  2002

In [4]:
frame2 = DataFrame(data, columns = ['year', 'state','pop','debt'],
                  index = ['one','tow', 'three','four','five'])
frame2

       year    state  pop debt
one    2000     Ohio  1.5  NaN
tow    2001     Ohio  1.7  NaN
three  2002     Ohio  3.6  NaN
four   2001  Nervada  2.4  NaN
five   2002  Nervada  2.9  NaN

In [7]:
frame2.year

one      2000
tow      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [6]:
frame2['year']

one      2000
tow      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [8]:
frame2.ix['three']

d:\dropbox\python\venv_32bit_py3.6.4_2018_0326\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [10]:
frame2.debt = 16.5
frame2

       year    state  pop  debt
one    2000     Ohio  1.5  16.5
tow    2001     Ohio  1.7  16.5
three  2002     Ohio  3.6  16.5
four   2001  Nervada  2.4  16.5
five   2002  Nervada  2.9  16.5